# RectangleLightShape Class

---
This class encapsulates a rectangle light shape.
SystemObject Autodesk.Revit.DB.LightingLightShape Autodesk.Revit.DB.LightingRectangleLightShape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RectangleLightShape : LightShape

    Public Class RectangleLightShape
    	Inherits LightShape

    public ref class RectangleLightShape : public LightShape

    type RectangleLightShape =
        class
            inherit LightShape
        end
The RectangleLightShape type exposes the following members.
| Name| Description
---|---|---
| RectangleLightShape|  Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
| RectangleLightShape(RectangleLightShape)|  Creates a copy of the given rectangle light shape
| RectangleLightShape(Double, Double)|  Creates a rectangle light shape object with the given emit length and width.
Top
| Name| Description
---|---|---
| EmitLength|  The emit length.
| EmitWidth|  The emit width.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape)
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightShape derived object. (Inherited from LightShape)
| Dispose| (Inherited from LightShape)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace